app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("checked", "created_at", "date", "description", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"